aqxml04.xml

<?xml version="1.0"?>
<!-- ******************************************** -->
<!-- **** AQXmlReceive Multi  consumer queue **** -->
<!-- **** ADT with LOB                       **** -->
<!-- ******************************************** -->

<Envelope xmlns= "http://schemas.xmlsoap.org/soap/envelope/">
      <Body>
      
        <AQXmlReceive xmlns = "http://ns.oracle.com/AQ/schemas/access">

          <consumer_options>
            <destination>aqxmladmn.cars_q1</destination>
            <consumer_name>DEALS_CARS_Q1</consumer_name>
            <batch_size>8</batch_size>
          </consumer_options>
	</AQXmlReceive>  
      </Body>
</Envelope> 
